src/Catalogs/Scan_АккумуляторныеБатареи/Scan_АккумуляторныеБатареи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_АккумуляторныеБатареи</name>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАКБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокАКБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_АккумуляторныеБатареи/ObjectModule.bsl
//rarus tenkam 07.09.2017 mantis 9425 +++
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_АккумуляторныеБатареи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_АккумуляторныеБатареи КАК Scan_АккумуляторныеБатареи
		|ГДЕ
		|	Scan_АккумуляторныеБатареи.Изделие = &Изделие
		|	И Scan_АккумуляторныеБатареи.ПорядокАКБ = &ПорядокАКБ
		|	И Scan_АккумуляторныеБатареи.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Изделие", Изделие);
	Запрос.УстановитьПараметр("ПорядокАКБ", ПорядокАКБ);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю();
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщение.Текст = "Для текущего изделия уже задана АКБ с таким номером!";
		Сообщение.Текст = НСтр("ru = 'Для текущего изделия уже задана АКБ с таким номером!'; en = 'Battery with the same number already added to the current product!'");
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  
		Сообщение.Поле = "ПорядокАКБ";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Ошибка справочника", УровеньЖурналаРегистрации.Ошибка,, Ссылка, Сообщение.Текст); //rarus bonmak 20.12.2019 15531	
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
//rarus tenkam 07.09.2017 mantis 9425 ---
